<a href="https://colab.research.google.com/github/xuhu357/DataAnalysis/blob/master/ch06_%EB%8D%B0%EC%9D%B4%ED%84%B0_%EB%A1%9C%EB%94%A9_%EC%A0%80%EC%9E%A5_%ED%8C%8C%EC%9D%BC%ED%98%95%EC%8B%9D.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## 데이터 로딩, 저장, 파일 형식

pandas에서 제공하는 파일 파싱 함수
* read_csv: 파일, URL, 또는 파일과 유사한 객체로부터 구분된 데이터를 읽어온다. 데이터 구분자는 ,로 한다.
* read_table: 위의 함수와 비슷하나, 구분자는 \t 이다.
* read_fwf: 고정폭 칼럼 형식에서 데이터를 읽어온다.
* read_clipboard: 클립보드에 있는 데이터를 읽어오는 read_table함수, 웹페이지에서 표를 긁어올때 유용.

In [15]:
from google.colab import files

uploaded = files.upload()

for fn in uploaded.keys():
  print('User uploaded file "{name}" with length {length} bytes'.format(
      name=fn, length=len(uploaded[fn])))

Saving csv_mindex.csv to csv_mindex.csv
User uploaded file "csv_mindex.csv" with length 111 bytes

In [4]:
!cat ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [0]:
import pandas as pd
import numpy as np
from pandas import DataFrame, Series

In [0]:
df = pd.read_csv('ex1.csv')

In [7]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [8]:
pd.read_table('ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [9]:
!cat ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [10]:
pd.read_csv('ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [11]:
pd.read_csv('ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [0]:
names = ['a', 'b', 'c', 'd', 'message']

In [13]:
pd.read_csv('ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [14]:
pd.read_csv('ex1.csv', index_col=['a', 'b'])

       c   d message
a b
1 2    3   4   hello
5 6    7   8   world
9 10  11  12     foo

In [16]:
pd.read_csv('csv_mindex.csv', index_col=['key1', 'key2'])

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [17]:
!cat ex3.txt

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [18]:
pd.read_table('ex3.txt', sep='\s+')

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [19]:
!cat ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [20]:
pd.read_csv('ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [21]:
!cat ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [0]:
result = pd.read_csv('ex5.csv')

In [24]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [25]:
result.isnull()

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

na_values 옵션은 리스트나 문자열 집합을 받아서 누락된 값을 처리한다.

In [0]:
result = pd.read_csv('ex5.csv', na_values=['NULL'])

In [27]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

각 칼럼마다 다른 NA 문자를 사전 값으로 넘겨 처리할 수도 있다.

In [0]:
sentinels = {'message': ['foo', 'NA'], 'something':['two']}

In [31]:
pd.read_csv('ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

결과에서 보다 싶이, something 칼럼에서는 two라는 값을 NaN로 취급하고, message 칼럼에서는 'foo' 란 값 혹은 'NA' 값을 NaN으로 취급한다는 말이다.

**read_csv / read_table 함수 인자**

* path: 파일 시스템에서의 위치, URL, 파일 객체를 나타내는 문자열.
* sep or delimiter : 필드를 구분하기 위해 사용할 연속된 문자나 정규 표현식.
* header: 칼럼의 이름으로 사용할 로우의 번호, 기본값은 0. 없으면, None으로 지정 가능
* index_col: 색인으로 사용할 칼럼 번호나 이름, 계층적 색인을 지정할 경우 리스트를 넘김.
* names: 칼럼 이름으로 사용할 리스트, header = None과 함께 사용.
* skiprows: 파일의 시작부터 무시할 로우의 개수 또는 무시할 로우 번호가 담긴 리스트
* na_values: NA 값으로 처리할 값들의 나열
* comment: 주석으로 분류되어 파싱하지 않을 문자 혹은 문자열.
* parse_dates: 날짜를 datetime으로 변환 할 지 여부. 기본값은 False.
* keep_date_col: 여러 칼럼을 datetime으로 변환 했을 경우, 원래 칼럼을 남겨둘지의 여부, 기본 값은 False.
* converters: 변환시 칼럼에 적용할 함수를 지정. 예를 들어 {'foo': f}는 foo칼럼에 함수 f를 적용한다는 말.
* dayfirst: 모호한 날짜 형식인 경우, 날짜 우선인지, month 우선인지 지정, 기본값은 False
* date_parser: 날짜 변환시 사용할 함수
* nrows: 파일의 첫 일부만 읽어올 때, 처음 몇줄을 읽을 것인지 지정.
* iterator: 파일을 조금씩 읽을 때, 사용하도록, TextParser객체를 반환하도록 한다. 기본 값은 False.
* chunksize:TextParser 객체에서 사용 할, 한번에 읽을 파일의 크기
* skip_footer: 무시할 파일의 마지막 줄 수
* verbose: 파싱 결과에 대한 정보를 출력한다. 숫자가 아닌 값이들어있는 칼럼이면서 누락된 값이 있다면, 줄 번호를 출력. 기본값은 False이다. 
* encoding: 유니코드 인코딩 종류 지정. UTF-8이면, 'utf-8'로 지정.
* squeeze: 로우가 하나뿐이라면, Series 객체를 반환, 기본 값은 false
* thousands: 숫자를 천단위로 끊을 때, 사용할 ' , ' 나, ' . ' 같은 구분자